In [8]:
import pandas as pd
import numpy as np
from numpy import nan as NA
from pandas import Series, DataFrame

In [48]:
#Q1.1

df = DataFrame([[1, 3.8, 2.1],
                  [2, NA, NA],
                  [NA, NA, NA],
                  [NA, 4.8, 1.7]])
df

     0    1    2
0  1.0  3.8  2.1
1  2.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  4.8  1.7

In [49]:
df2 = df.fillna(method='ffill')
df2

     0    1    2
0  1.0  3.8  2.1
1  2.0  3.8  2.1
2  2.0  3.8  2.1
3  2.0  4.8  1.7

In [50]:
#Q1.2
df2
df2['diff'] = df2.max(axis=1) - df2.min(axis=1)
df2

     0    1    2  diff
0  1.0  3.8  2.1   2.8
1  2.0  3.8  2.1   1.8
2  2.0  3.8  2.1   1.8
3  2.0  4.8  1.7   3.1

In [51]:
#Q1.3
ser = pd.Series(np.random.randint(1, 6, [12]))
print(ser)
print(ser.value_counts())
ser.value_counts().index[0]

0     4
1     5
2     5
3     5
4     3
5     5
6     5
7     1
8     2
9     5
10    2
11    2
dtype: int64
5    6
2    3
4    1
3    1
1    1
dtype: int64

5

In [70]:
# Q2.1
df

     0    1    2
0  1.0  3.8  2.1
1  2.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  4.8  1.7

In [73]:
df1 = df[(df[0].notnull()) | (df1[1].notnull())]
#df1 = df1[df1[0].notnull()]
df1

     0    1    2
0  1.0  3.8  2.1
1  2.0  NaN  NaN
3  NaN  4.8  1.7

In [66]:
df[[1] == 1.0]

0      2
1    NaN
2    NaN
3    NaN
dtype: object

In [74]:
# Q2.2

def avg_category(cat):
    df_cat = df[df['Category'] == cat]
    avg = df_cat['Category'].mean()
    return avg

df['Price'] = df['Price'].fillna(df['Category'].apply(avg_category)

SyntaxError: unexpected EOF while parsing (1382014683.py, line 8)

In [75]:
# Q2.3

# Q3

create table author (
    id int primary key,
    name varchar(50) not null,
    email varchar(50) not null
);

create table title (
    id int auto_increment primary key,
    name varchar(50) not null,
);

create table title_author (
    title_id int,
    foreign key (title_id) references title(id),
    author_id in,
    foreign key (author_id) references author(id)
    primary key (title_id, author_id)
);

create table publisher (
    name varchar(30) primary key
);

create tabel book (
    isbn int(13) primary key,
    publication date,
    format char(9),
    price decimal,
    copies_sold int, 
    publisher varchar(30) not null,
    foreign key (publisher) references publisher(name),
    title_id int not null,
    foreign key (title_id) references title(id)
);

# Q4

##### Q4.1 What is the average price of a hotel room in London, England?

select avg(R.Price) as avg_price
from Hotel H, Room R
where H.HotelNo = R.HotelNo and H.City = 'London' and H.Country = 'England';

##### Q4.2 How many different guests from New York, USA, have made bookings for the month of August for any year in any hotel?

select count(distinct G.GuestNo)
from Guest G, Booking B
where G.GuestNo = B.GuestNo and G.GuestCity = 'New York' and G.GuestCountry = 'USA' and month(B.dateFrom) = 08;

##### Q4.3 Get all rooms with corresponding hotel numbers that are currently unoccupied at the Hilton chain of hotels.

select R.HotelNo as Hotel_Numbers
from Room R 
where R.HotelNo not in (select HotelNo from Booking B, Hotel H where B.HotelNo = H.HotelNo and H.HotelChainName = 'Hilton') as Hilton_Occupied

##### Q4.4 Get the country-wise revenue for each hotel chain for the year 2021. The result should have columns named 'HotelChain', 'Country' and 'Revenue'

select H.HoteChainName as HotelChain, H.Country as Country, sum(R.Price) as Revenue
from Hotel H, Room R, Booking B
where H.HotelNo = R.HotelNo and H.HotelNo = B.HotelNo
group by H.HotelChainName;